/* REXX */
CLRSCN
/* TRACE ALL */
SAY ' '
SAY 'ALGORITHM'
SAY '---------'
SAY ' '
SAY 'READ AND TOTAL 2 NUMBERS'
SAY ' '
PARSE PULL NUM1 NUM2
TNUM = NUM1 + NUM2
SAY TNUM
EXIT
