/* rexx */
"alloc da('ibmuser.sql(select)') fi(inmbr) shr reuse"
"alloc da('ibmuser.sql(select)') fi(outmbr) shr reuse"
"execio 8 diskr inmbr (stem rec. finis"
"execio * diskw outmbr (stem rec. finis"
exit 0
