/* REXX TO ISSUE CONSOLE COMMANDS */
SAY 'BEGIN'
CMD.1 = 'D T'
CMD.2 = 'D R,L'
CMD.3 = 'D TS,L'
CMD.4 = '$DSPL'
SAY 'CMD IS' CMD.0
"CONSOLE ACTIVATE"
DO X = 1 TO 4
"CONSOLE SYSCMD("CMD.X")"
MCODE=GETMSG('RESMSG1.','SOL',,,60)
SAY "MCODE = " MCODE
SAY GETMSG('RESMSG1.','SOL',,,60)
IF RESMSG1.0 = 0 THEN DO
  SAY 'NO MESSAGE RETURNED'
  RETURN
END
ELSE
  DO I=1 TO RESMSG1.0
    SAY RESMSG1.I
  END
  RESMSG1.0=0
END
"CONSOLE DEACTIVATE"
EXIT
