//NEWCAT JOB 1,NOTIFY=&SYSUID,CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//      EXEC PGM=IEFBR14
//NEWDS DD DSN=&SYSUID..UNEM.DATA,DISP=(NEW,CATLG),VOL=SER=VPWRKA,
//         UNIT=3390,SPACE=(CYL,(3,1,25)),
//         DCB=(RECFM=FB,LRECL=3000,BLKSIZE=0)
//
