//EDACK    JOB 01,UPLOAD,CLASS=A,MSGCLASS=H,NOTIFY=EDACK,
//         REGION=512K,USER=EDACK,PASSWORD=EHPC21
//IEBGENER EXEC PGM=IEBGENER,REGION=128K
//SYSIN    DD  DUMMY
//SYSPRINT DD  SYSOUT=H
//SYSUT1   DD  *
//CBL0106A JOB 1,NOTIFY=&SYSUID
//***************************************************/
// SET CBLPGM=CBL0106A
//COBRUN  EXEC IGYWCL
//COBOL.SYSLIB DD DSN=&SYSUID..COPYLIB,DISP=SHR
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(&CBLPGM),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(&CBLPGM),DISP=SHR
//***************************************************/
// IF RC = 0 THEN
//***************************************************/
//RUN     EXEC PGM=&CBLPGM
//STEPLIB   DD DSN=&SYSUID..LOAD,DISP=SHR
//ACCTFILE   DD DSN=&SYSUID..DATA.ACCTFILE,DISP=SHR
//PRTFILE   DD SYSOUT=*,OUTLIM=15000
//SYSOUT    DD SYSOUT=*,OUTLIM=15000
//CEEDUMP   DD DUMMY
//SYSUDUMP  DD DUMMY
//***************************************************/
// ELSE
// ENDIF
//SYSUT2   DD  DSN=EDACK.JCL(CBL0106A),
//*             DISP=(NEW,CATLG,DELETE),
//             DISP=SHR,
//             UNIT=SYSDA,
//             VOL=SER=TSO002
//*             DCB=(RECFM=FB,LRECL=80),
//*             SPACE=(TRK,(1,10),RLSE)
