//EDACK    JOB 01,UPLOAD,CLASS=A,MSGCLASS=H,NOTIFY=EDACK,
//         REGION=512K,USER=EDACK,PASSWORD=EHPC21
//IEBGENER EXEC PGM=IEBGENER,REGION=128K
//SYSIN    DD  DUMMY
//SYSPRINT DD  SYSOUT=H
//SYSUT1   DD  *
$include   ../cbl/cbl0106a.cbl
//SYSUT2	DD	DSN=EDACK.CBL(CBL0106A),
//             DISP=SHR,
//             UNIT=SYSDA,
//             VOL=SER=TSO003
//*             DCB=(RECFM=FB,LRECL=80),
//*             SPACE=(TRK,(1,10),RLSE)
